Revit 2024 API
BuiltInFailures.DocumentFailures.DUExcessiveRegeneration Property
 Third party updater '[Name]' has caused an infinite loop and its action had to be canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DUExcessiveRegeneration { get; }
Visual Basic
Public Shared ReadOnly Property DUExcessiveRegeneration As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DUExcessiveRegeneration {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace